[
  {
    "name": "Desarrollador Frontend",
    "company": "Vinneren",
    "ubication": "México, Ciudad de México",
    "workModality": "Remoto",
    "schedule": "Tiempo completo",
    "activities": [
      "Implementé un Sistema de Gestión de Información de Productos (PIM) con dashboard, APIs de gestión de datos y usuarios, e integración de IA. Utilicé Gemini, Cognito, Firebase, React, TypeScript, Node.js y Express, mejorando la centralización y gestión de productos.",
      "Desarrollé un programa de promociones y lealtad con un dashboard interactivo, utilizando React, Redux, TypeScript, Axios, Cognito y Material-UI. Esto impulsó la participación de los clientes y fortaleció la lealtad hacia la marca.",
      "Creé plantillas de correo y resolví un problema de prorrateo en el checkout que impedía el uso correcto del checkout en una tienda, optimizando así el proceso con scripts personalizados utilizando HTML, CSS y jQuery. Esto mejoró la experiencia de usuario, aumentó la retención de clientes.",
      "Creé una página estática para la presentación de productos, incluyendo formularios de contacto y animaciones complejas, usando Next.js y TypeScript. Esto mejoró la presentación y visualización de los productos."
    ],
    "skills": [
      "react",
      "next",
      "redux",
      "jquery",
      "javascript",
      "typescript",
      "node",
      "express",
      "mui",
      "tailwind"
    ],
    "date": "Septiembre 2022 - actualidad"
  },
  {
    "name": "Desarrollador Frontend",
    "company": "Hello México",
    "ubication": "México, Ciudad de México",
    "workModality": "Remoto",
    "schedule": "Medio tiempo",
    "activities": [
      "Lideré y desarrollé el sitio oficial de la empresa con HTML, CSS, JavaScript, Bootstrap, logrando un sitio web responsivo y visualmente alineado con la marca.",
      "Implementé una aplicación web dinámica con funcionalidades CRUD, usando React en el Front end y PHP en el Back-end para una gestión eficiente de datos.",
      "Elaboré wireframes detallados para el blog de Conexión Fácil usando Balsamiq facilitando una clara visualización del diseño y estructura antes del desarrollo",
      "Creé wireframes detallados para un blog en el software Balsamiq, facilitando la visualización del diseño antes del desarrollo.",
      "Colaboré en un proyecto para desarrollar interfaces de usuario interactivas con React JS."
    ],
    "skills": [
      "html",
      "css",
      "php",
      "react",
      "javascript",
      "github",
      "bootstrap"
    ],
    "date": "Enero 2022 - Marzo 2022"
  }
]
